#Определить в каком месяце года(с 1981 по 2040) будет пятница 13.
y = int(input('Введите любой год с 1981 по 2040 год:'))
if y == 1981 or y ==1987 or y ==1998 or y ==2009 or y ==2015 or y ==2026 or y ==2037:
    print('Февраль, март, ноябрь')
elif y == 1982 or y ==1993 or y ==1999 or y ==2010 or y ==2021 or y ==2027 or y ==2038:
    print('Август')
elif y == 1983 or y ==1988 or y ==1994 or y ==2005 or y ==2011 or y ==2016 or y == 2022 or y ==2033 or y ==2039:
    print('Май')
elif y == 1985 or y ==1991 or y ==1996 or y ==2002 or y ==2013 or y ==2019 or y == 2024 or y == 2030:
    print('Сентябрь, декабрь')
elif y == 1984 or y ==2012 or y ==2040:
    print('Январь, апрель, июль')
elif y == 1986 or y ==1997 or y ==2003 or y ==2008 or y ==2014 or y ==2025 or y==2031 or y==2036:
    print('Июнь')
elif y == 1989 or y ==1995 or y ==2006 or y ==2017 or y ==2023 or y ==2034:
    print('Январь, октябрь')
elif y == 1990 or y ==2001 or y ==2007 or y ==2018 or y ==2029 or y ==2035:
    print('Апрель, июль')
elif y == 1992 or y ==2020:
    print('Март, ноябрь')
elif y == 2000 or y ==2028:
    print('Октябрь')
elif y == 2004 or y == 2032:
    print('Февраль, август')
elif y>2040 or y<1981:
    print('Неверно введен год')



